app/controllers/movies_controller.rb

    def index
      @movies = Movie.find(:all, :order => (params[:sort_by]))
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" IN (NULL, NULL)