app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG'))  ORDER BY release_date
SELECT "movies".* FROM "movies"  ORDER BY release_date
---
    def index

      @all_ratings = Movie.ratings

      #debugger

      if params[:ratings]

        @movies = Movie.where("rating IN (?)", params[:ratings].keys).order(params[:sort])

      else
        @movies = Movie.order(params[:sort])